AhmedZidan11/BLDC_FOC_STM32F4_BareMetal/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "stm32f446xx.h"
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include "config/app_motor_test_config.h"
#include "config/project_config.h"
#include "drivers/as5600_analog.h"
#include "board/board.h"
#include "drivers/adc.h"
#include "drivers/log.h"
#include "motor/motor.h"
#include "motor/motor_3pwm.h"
#include "motor/motor_electrical_angle.h"
#include "motor/motor_openloop.h"
#include "motor/motor_speed_reference_estimator.h"

extern usart2_handle_t USART2_H;

typedef struct {
	uint32_t phase_increment_ramp_step_u32;
} app_motor_test_derived_cfg_t;

typedef struct app_context_t {
	motor_handle_t motor_h;
	motor_3pwm_handle_t motor_3pwm_h;
	motor_openloop_handle_t motor_openloop_h;
	motor_electrical_angle_handle_t motor_electrical_angle_h;
	motor_speed_reference_estimator_handle_t motor_speed_reference_estimator_h;
	as5600_analog_handle_t as5600_analog_h;
	uint32_t last_angle_log_ms;
	uint32_t last_openloop_update_ms;
	uint32_t alignment_start_ms;
	uint64_t latest_logged_timestamp_us;
	int32_t latest_logged_speed_mrpm;
	uint16_t latest_logged_mechanical_angle_u16;
	bool latest_sample_valid;
	bool alignment_done;
} app_context_t;

int __io_putchar(int ch)
{
    uint8_t c = (uint8_t)ch;
    size_t w = usart2_write(&USART2_H, &c, 1u);

    return (w == 1u) ? ch : EOF;
}

/**
 * @brief Trap on one fatal application error before runtime drive is active.
 *
 * @param tag Log tag.
 * @param msg Log message.
 */
static void app_fatal_trap(const char *tag, const char *msg)
{
	LOGE(tag, msg);
	while(1) {}
}

/**
 * @brief Stop the powered test path and trap on one fatal runtime error.
 *
 * @param app Pointer to application runtime context.
 * @param tag Log tag.
 * @param msg Log message.
 */
static void app_fatal_stop(app_context_t *app, const char *tag, const char *msg)
{
	/* Disable the power stage before trapping on a runtime fault. */
	gpio_write(MOTOR_EN.pin, false);
	app->motor_h.status.is_enabled = false;
	(void)motor_3pwm_stop(&app->motor_3pwm_h);
	LOGE(tag, msg);
	while(1) {}
}

/**
 * @brief Build the derived open-loop ramp configuration for the current test.
 *
 * @return Derived motor test values used by the open-loop helper.
 */
static app_motor_test_derived_cfg_t app_build_motor_test_derived_cfg(void)
{
	const uint64_t motor_test_mrpm_per_rpm = 1000ULL;
	const uint32_t motor_test_ramp_update_count =
			(uint32_t)((APP_MOTOR_TEST_RAMP_DURATION_MS + APP_MOTOR_TEST_UPDATE_PERIOD_MS - 1u) /
					  APP_MOTOR_TEST_UPDATE_PERIOD_MS);
	const uint64_t motor_test_target_phase_increment_num =
			(uint64_t)APP_MOTOR_TEST_TARGET_MECHANICAL_SPEED_MRPM *
			(uint64_t)APP_MOTOR_TEST_POLE_PAIRS *
			(uint64_t)APP_MOTOR_TEST_UPDATE_PERIOD_MS *
			MOTOR_OPENLOOP_PHASE_ACCUM_FULL_TURN_U32;
	const uint32_t motor_test_target_phase_increment_u32 =
			(uint32_t)((motor_test_target_phase_increment_num +
					   ((MOTOR_OPENLOOP_MS_PER_MINUTE * motor_test_mrpm_per_rpm) / 2u)) /
					  (MOTOR_OPENLOOP_MS_PER_MINUTE * motor_test_mrpm_per_rpm));
	app_motor_test_derived_cfg_t derived_cfg = {0};

	/* Reach the target phase increment in roughly APP_MOTOR_TEST_RAMP_DURATION_MS. */
	derived_cfg.phase_increment_ramp_step_u32 =
			(uint32_t)((motor_test_target_phase_increment_u32 + motor_test_ramp_update_count - 1u) /
					  motor_test_ramp_update_count);

	return derived_cfg;
}

/**
 * @brief Build the shared motor runtime state for the current test.
 *
 * @return Initialized shared motor runtime container.
 */
static motor_handle_t app_build_motor_handle(void)
{
	motor_handle_t motor_h = {
			.measurements = {0},
			.targets = {
					.target_mechanical_speed_mrpm = APP_MOTOR_TEST_TARGET_MECHANICAL_SPEED_MRPM,
					.target_amplitude_permyriad = APP_MOTOR_TEST_ALIGNMENT_AMPLITUDE_PERMYRIAD,
			},
			.limits = {
					.pole_pairs = APP_MOTOR_TEST_POLE_PAIRS,
					.max_target_mechanical_speed_mrpm = 0,
					.max_amplitude_permyriad = APP_MOTOR_TEST_MAX_AMPLITUDE_PERMYRIAD,
			},
			.status = {
					.mode = MOTOR_MODE_INACTIVE,
					.is_initialized = false,
					.is_enabled = false,
					.has_valid_mechanical_angle = false,
					.has_valid_electrical_angle = false,
					.has_valid_mechanical_speed = false,
			},
			.openloop = {0},
	};

	return motor_h;
}

/**
 * @brief Initialize the application runtime context.
 *
 * @param app Pointer to application runtime context.
 */
static void app_init_context(app_context_t *app)
{
	app->motor_h = app_build_motor_handle();
	app->motor_3pwm_h = (motor_3pwm_handle_t){0};
	app->motor_openloop_h = (motor_openloop_handle_t){0};
	app->motor_electrical_angle_h = (motor_electrical_angle_handle_t){0};
	app->motor_speed_reference_estimator_h = (motor_speed_reference_estimator_handle_t){0};
	app->as5600_analog_h = (as5600_analog_handle_t){0};
	app->last_angle_log_ms = 0u;
	app->last_openloop_update_ms = 0u;
	app->alignment_start_ms = 0u;
	app->latest_logged_timestamp_us = 0u;
	app->latest_logged_speed_mrpm = 0;
	app->latest_logged_mechanical_angle_u16 = 0u;
	app->latest_sample_valid = false;
	app->alignment_done = false;
}

/**
 * @brief Convert one full-turn uint16 angle into degrees x10 for debug logs.
 *
 * @param angle_u16 Angle in full-turn uint16 units.
 * @return Angle in tenths of degree.
 */
static uint16_t app_angle_u16_to_deg_x10(uint16_t angle_u16)
{
	/* deg_x10 = angle_u16 * 3600 / 65536, rounded to nearest. */
	uint32_t deg_x10_num = ((uint32_t)angle_u16 * 3600u) + 32768u;
	return (uint16_t)(deg_x10_num / 65536u);
}

/**
 * @brief Initialize the application modules for the powered test.
 *
 * @param app Pointer to application runtime context.
 * @param motor_3pwm_cfg Pointer to motor 3PWM configuration.
 * @param motor_openloop_cfg Pointer to motor open-loop configuration.
 * @param motor_electrical_angle_cfg Pointer to electrical-angle configuration.
 * @param motor_speed_reference_estimator_cfg Pointer to reference-estimator configuration.
 * @param as5600_analog_cfg Pointer to AS5600 analog configuration.
 */
static void app_init_modules(app_context_t *app,
							 const motor_3pwm_cfg_t *motor_3pwm_cfg,
							 const motor_openloop_cfg_t *motor_openloop_cfg,
							 const motor_electrical_angle_cfg_t *motor_electrical_angle_cfg,
							 const motor_speed_reference_estimator_cfg_t *motor_speed_reference_estimator_cfg,
							 const as5600_analog_cfg_t *as5600_analog_cfg)
{
	/* Initialize the board drivers before the application modules. */
	board_init();
	log_init(&USART2_H);

	/* Initialize the PWM power stage used by the open-loop path. */
	if (!motor_3pwm_init(&app->motor_3pwm_h, motor_3pwm_cfg))
	{
		app_fatal_trap("M3PWM", "init failed");
	}

	/* Initialize the open-loop helper for the active motor test. */
	if (!motor_openloop_init(&app->motor_openloop_h, motor_openloop_cfg))
	{
		app_fatal_trap("MOPEN", "init failed");
	}

	/* Initialize the measured electrical-angle helper for future sensored paths. */
	if (!motor_electrical_angle_init(&app->motor_electrical_angle_h, motor_electrical_angle_cfg))
	{
		app_fatal_trap("MEANG", "init failed");
	}

	/* Initialize the reference speed-estimator baseline. */
	if (!motor_speed_reference_estimator_init(&app->motor_speed_reference_estimator_h,
											  motor_speed_reference_estimator_cfg))
	{
		app_fatal_trap("MEST", "init failed");
	}

	/* Initialize the AS5600 analog acquisition helper. */
	if (!as5600_analog_init(&app->as5600_analog_h, as5600_analog_cfg))
	{
		app_fatal_trap("AS5600", "init failed");
	}
}

/**
 * @brief Start the powered open-loop motor test from the alignment vector.
 *
 * @param app Pointer to application runtime context.
 * @param alignment_electrical_angle_u16 Startup electrical angle.
 */
static void app_start_motor_test(app_context_t *app, uint16_t alignment_electrical_angle_u16)
{
	/* Preload the startup alignment vector before PWM output starts. */
	if (!motor_openloop_apply(&app->motor_openloop_h, alignment_electrical_angle_u16))
	{
		app_fatal_trap("MOPEN", "alignment apply failed");
	}

	/* Start the PWM output before enabling the power stage. */
	if (!motor_3pwm_start(&app->motor_3pwm_h))
	{
		app_fatal_trap("M3PWM", "start failed");
	}

	/* Enable the motor power stage and seed the application timing markers. */
	gpio_write(MOTOR_EN.pin, true);
	app->motor_h.status.is_enabled = true;
	app->alignment_start_ms = SYSTICK_GetTimeMs();
	app->last_angle_log_ms = app->alignment_start_ms;
	app->last_openloop_update_ms = app->alignment_start_ms;
}

/**
 * @brief Update the application state from one consumed AS5600 angle sample.
 *
 * @param app Pointer to application runtime context.
 * @param mechanical_angle_u16 Published mechanical angle sample.
 * @param sample_timestamp_us Current sample-consume timestamp.
 */
static void app_handle_consumed_angle_sample(app_context_t *app,
											 uint16_t mechanical_angle_u16,
											 uint64_t sample_timestamp_us)
{
	/* Publish the latest sensor angle into the shared motor state. */
	app->motor_h.measurements.mechanical_angle_u16 = mechanical_angle_u16;
	app->motor_h.status.has_valid_mechanical_angle = true;

	/* Convert the measured mechanical angle into measured electrical angle. */
	if (!motor_electrical_angle_update(&app->motor_electrical_angle_h, mechanical_angle_u16))
	{
		app_fatal_stop(app, "MEANG", "update failed");
	}

	/* Feed the reference estimator with the current sample-consume timestamp. */
	if (!motor_speed_reference_estimator_update(&app->motor_speed_reference_estimator_h,
												mechanical_angle_u16,
												sample_timestamp_us))
	{
		app_fatal_stop(app, "MEST", "update failed");
	}

	/* Keep the latest consumed sample for the reduced-rate UART log stream. */
	app->latest_logged_timestamp_us = sample_timestamp_us;
	app->latest_logged_mechanical_angle_u16 = mechanical_angle_u16;
	app->latest_logged_speed_mrpm = app->motor_h.measurements.measured_mechanical_speed_mrpm;
	app->latest_sample_valid = true;
}

/**
 * @brief Advance the alignment hold and the active open-loop drive path.
 *
 * @param app Pointer to application runtime context.
 * @param motor_openloop_cfg Pointer to motor open-loop configuration.
 * @param now_ms Current time in milliseconds.
 */
static void app_update_openloop_drive(app_context_t *app,
									  const motor_openloop_cfg_t *motor_openloop_cfg,
									  uint32_t now_ms)
{
	uint16_t raw_electrical_angle_u16 = 0u;
	uint16_t electrical_offset_u16 = 0u;

	/* Hold the alignment vector before phase progression starts. */
	if (app->alignment_done == false)
	{
		if ((now_ms - app->alignment_start_ms) >= APP_MOTOR_TEST_ALIGNMENT_DURATION_MS)
		{
			/* Wait for one valid consumed sensor sample before alignment calibration. */
			if (app->latest_sample_valid == false)
			{
				return;
			}

			/* Convert measured mechanical angle into raw electrical angle without offset. */
			if (!motor_electrical_angle_compute_raw(&app->motor_electrical_angle_h,
													app->latest_logged_mechanical_angle_u16,
													&raw_electrical_angle_u16))
			{
				app_fatal_stop(app, "MEANG", "raw angle failed");
			}

			/* offset = commanded_alignment_electrical - measured_raw_electrical. */
			electrical_offset_u16 =
					(uint16_t)(APP_MOTOR_TEST_ALIGNMENT_ELECTRICAL_ANGLE_U16 -
							  raw_electrical_angle_u16);
			if (!motor_electrical_angle_set_offset(&app->motor_electrical_angle_h, electrical_offset_u16))
			{
				app_fatal_stop(app, "MEANG", "offset set failed");
			}

			/* Publish the calibrated measured electrical angle from the same alignment sample. */
			if (!motor_electrical_angle_update(&app->motor_electrical_angle_h, app->latest_logged_mechanical_angle_u16))
			{
				app_fatal_stop(app, "MEANG", "aligned update failed");
			}

			/* Emit one machine-friendly alignment capture record. */
			printf("A,%lu,%u,%u,%u\r\n",
				   (unsigned long)app->latest_logged_timestamp_us,
				   (unsigned)app->latest_logged_mechanical_angle_u16,
				   (unsigned)raw_electrical_angle_u16,
				   (unsigned)electrical_offset_u16);

			app->motor_h.targets.target_amplitude_permyriad = APP_MOTOR_TEST_RUN_AMPLITUDE_PERMYRIAD;
			app->alignment_done = true;
			app->last_openloop_update_ms = now_ms;
		}

		return;
	}

	/* Advance the active powered open-loop command path at the configured period. */
	if ((now_ms - app->last_openloop_update_ms) >= motor_openloop_cfg->update_period_ms)
	{
		if (!motor_openloop_update(&app->motor_openloop_h))
		{
			app_fatal_stop(app, "MOPEN", "update failed");
		}

		app->last_openloop_update_ms += motor_openloop_cfg->update_period_ms;
	}
}

/**
 * @brief Emit one reduced-rate UART log line from the latest consumed sample.
 *
 * @param app Pointer to application runtime context.
 * @param now_ms Current time in milliseconds.
 */
static void app_emit_angle_log(app_context_t *app, uint32_t now_ms)
{
	uint16_t raw_electrical_angle_u16 = 0u;
	uint16_t mechanical_angle_deg_x10 = 0u;
	uint16_t raw_electrical_angle_deg_x10 = 0u;
	uint16_t measured_electrical_angle_deg_x10 = 0u;
	uint16_t electrical_offset_deg_x10 = 0u;

	/* Print the latest consumed sample at the configured lower UART rate. */
	if (((now_ms - app->last_angle_log_ms) >= APP_MOTOR_TEST_ANGLE_LOG_PERIOD_MS) &&
		(app->latest_sample_valid == true))
	{
		/* Recompute raw electrical angle from the current measured mechanical angle. */
		if (!motor_electrical_angle_compute_raw(&app->motor_electrical_angle_h,
												app->motor_h.measurements.mechanical_angle_u16,
												&raw_electrical_angle_u16))
		{
			app_fatal_stop(app, "MEANG", "raw debug failed");
		}

		/* Convert angle fields to tenths of degree for readable runtime diagnostics. */
		mechanical_angle_deg_x10 =
				app_angle_u16_to_deg_x10(app->motor_h.measurements.mechanical_angle_u16);
		raw_electrical_angle_deg_x10 = app_angle_u16_to_deg_x10(raw_electrical_angle_u16);
		measured_electrical_angle_deg_x10 =
				app_angle_u16_to_deg_x10(app->motor_h.measurements.electrical_angle_u16);
		electrical_offset_deg_x10 =
				app_angle_u16_to_deg_x10(app->motor_electrical_angle_h.electrical_offset_u16);

		printf("D,%u,%u,%u,%u,%u\r\n",
			   (unsigned)mechanical_angle_deg_x10,
			   (unsigned)raw_electrical_angle_deg_x10,
			   (unsigned)measured_electrical_angle_deg_x10,
			   (unsigned)electrical_offset_deg_x10,
			   (unsigned)((app->alignment_done == true) ? 1u : 0u));
		app->last_angle_log_ms += APP_MOTOR_TEST_ANGLE_LOG_PERIOD_MS;
	}
}

int main(void)
{
	const app_motor_test_derived_cfg_t derived_cfg = app_build_motor_test_derived_cfg();
	app_context_t app = {0};
	const motor_3pwm_cfg_t motor_3pwm_cfg = {
			.pwm_h = &PWM_H,
	};
	const motor_openloop_cfg_t motor_openloop_cfg = {
			.motor_h = &app.motor_h,
			.motor_3pwm_h = &app.motor_3pwm_h,
			.update_period_ms = APP_MOTOR_TEST_UPDATE_PERIOD_MS,
			.phase_increment_ramp_step_u32 = derived_cfg.phase_increment_ramp_step_u32,
	};
	const motor_electrical_angle_cfg_t motor_electrical_angle_cfg = {
			.motor_h = &app.motor_h,
			.electrical_offset_u16 = 0u,
	};
	const motor_speed_reference_estimator_cfg_t motor_speed_reference_estimator_cfg = {
			.motor_h = &app.motor_h,
			.history_sample_count = APP_MOTOR_TEST_SPEED_REFERENCE_ESTIMATOR_HISTORY_SAMPLE_COUNT,
	};
	const as5600_analog_cfg_t as5600_analog_cfg = {
			.adc_h = &ADC1_IN0_H,
			.adc_full_scale = (uint16_t)APP_MOTOR_TEST_AS5600_ADC_FULL_SCALE,
			.raw_sample_period_us = APP_MOTOR_TEST_ANGLE_ADC_SAMPLE_PERIOD_US,
			.raw_samples_per_publish = APP_MOTOR_TEST_ANGLE_PUBLISH_RAW_SAMPLE_COUNT,
			.mechanical_angle_direction = (APP_MOTOR_TEST_SENSOR_DIRECTION < 0) ?
					AS5600_ANALOG_DIRECTION_REVERSE :
					AS5600_ANALOG_DIRECTION_FORWARD,
	};
	uint16_t mechanical_angle_u16 = 0u;

	app_init_context(&app);
	app_init_modules(&app,
					 &motor_3pwm_cfg,
					 &motor_openloop_cfg,
					 &motor_electrical_angle_cfg,
					 &motor_speed_reference_estimator_cfg,
					 &as5600_analog_cfg);
	app_start_motor_test(&app, APP_MOTOR_TEST_ALIGNMENT_ELECTRICAL_ANGLE_U16);

	/* Loop forever */
	while(1)
	{
		uint32_t now_ms = SYSTICK_GetTimeMs();
		uint64_t now_us = SYSTICK_GetTimeUs();

		/* Service SysTick-driven AS5600 raw-sample scheduling. */
		if (!as5600_analog_service(&app.as5600_analog_h, now_us))
		{
			app_fatal_stop(&app, "AS5600", "update failed");
		}

		/* Consume one fixed-period published AS5600 mechanical-angle sample. */
		if (as5600_analog_consume_published_sample(&app.as5600_analog_h, &mechanical_angle_u16))
		{
			app_handle_consumed_angle_sample(&app, mechanical_angle_u16, now_us);
		}

		/* Advance the active powered open-loop motor test path. */
		app_update_openloop_drive(&app, &motor_openloop_cfg, now_ms);

		/* Emit the reduced-rate UART log line. */
		app_emit_angle_log(&app, now_ms);
	}
}
